<div class="text-container" style="margin-top: 40px; min-height: 600px">
    <link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
    <h1>Mouse_Hunting_CSS</h1>
    <p style="margin-top: 10px">Добро пожаловать на образовательный мини-курс "Mouse_Hunting_CSS", посвященный освоению CSS flexbox! Если вы хотите научиться создавать гибкие и адаптивные макеты для своих веб-страниц, то этот курс идеально подойдет для вас. <br><br>
    Flexbox — это один из самых мощных инструментов веб-разработки, позволяющий легко и эффективно организовывать элементы на странице. Он предлагает новые возможности для управления размещением элементов внутри контейнера, а также контроля над их размерами и порядком.<br><br>
    В рамках этого курса мы познакомим вас с основными концепциями flexbox, научимся задавать гибкие свойства для контейнера и его элементов. Мы рассмотрим различные способы выравнивания элементов и контроля за их расположением. Вы узнаете, как легко создавать разметку веб-страницы с помощью flexbox и создавать адаптивные дизайны для всех устройств.<br><br>
    Курс направлен на то, чтобы обеспечить вас всей необходимой информацией и практическими заданиями для освоения CSS flexbox. Вы будете работать с реальными примерами, чтобы увидеть, как можно использовать все возможности этого инструмента для создания красивых и функциональных веб-дизайнов.<br><br>
    Не важно, являетесь ли вы новичком в веб-разработке или уже имеете определенный опыт, этот курс полезен для всех, кто хочет улучшить свои навыки веб-разработки и освоить новые технологии.<br><br>
    Давайте вместе погрузимся в увлекательный мир гибких макетов и начнем создавать профессиональные и современные дизайны с помощью CSS flexbox! Уверены, что вам понравится этот курс и вы получите все необходимые знания, чтобы стать экспертом в этой области!<br>
    </p>
    <a href="/game" class="big-button">Перейти к игре</a>
</div>